# raw = "かい,ロック,たかし,よよよ,く★す☆ぐ★り【プロフィール…,タカノ,まさ,しいんち,こたろう,ヨウヘイ,ゴウキ,たいら,育也,まつきむ,こ,マイク,スレン,バナナ,よし,テラ,ふうさん,しげっち,亮太,テラ,テラ,テラ,よーた,タク,mayu,ピピ,ゆき,なる,エス,天照,兄,GO,大谷,ひろや,ゆう,あまちゃん,こーたろー,ふじおか,mos,マサ"
raw = "りょう,けんと,k,かえで,ごんぞー,KEN,リョウ,リムル,ジュン,りゅう,らい,ゆーき,イッセイ,ギンガ,とよ,ゆう,エス,はる,もろふか,山下,タカ,Be,カズヤ,ゴウキ,ゆうき,育也,smoker,taka,たくや,ヤマト,ひ,スレン,ゆーすけ,あまちゃん,new,たくた,クロ,おでん,ひろ,タク,天照,もち,ゆーと,パピー,なおき,か,ファブ,アガシ,ロド,ナオキ,Saka"
raw = "たかし,ｂｂ,しゅう,らい,なお,カズアキ,卍丸,れ,イッセイ,モーリン,山崎,まぁ,ひろし,シャクガン,ぷるぷる,はるき,りき,アスカ,のりまき,あき,たいら,みく,🩷ミミ太郎💕,Tomo,耕作,ひろ,たくす,タク,HONDA,マサユキ,Be"
raw = "んたすけ,兄,ファレンガー,あ,山崎,サボ,たつ,ネック,達哉,ゆう,ジョニー,まさ,フンガース,らい,さとうあまい,はる,ソラ,こ,しゅーへい,まさや,りく"

# えりか
raw = "んたすけ,兄,ファレンガー,あ,山崎,サボ,たつ,ネック,達哉,ゆう,ジョニー,まさ,フンガース,らい,さとうあまい,はる,ソラ,こ,しゅーへい,まさや,りく,すー,ささき,しょーくん,ソータ,ケイ,アガシ,やす,たあ,おーさん,隠れん坊,タク,まさと,しゅう,メロス,エス,ゴキジェット,クローハウザー,speedman,ゆうた,ちょいエコロ爺,もとき,しょう,れん,t,水卜,やま,たろさん,ユウ,り,よしつぐ,スザク,りょーま,タウン,わー,ひろ,ヒロト,なお"
# えりか9/5
raw ="んたすけ,兄,ファレンガー,あ,山崎,サボ,たつ,ネック,達哉,ゆう,ジョニー,まさ,フンガース,らい,さとうあまい,はる,ソラ,こ,しゅーへい,まさや,りく,すー,ささき,しょーくん,ソータ,ケイ,アガシ,やす,たあ,おーさん,隠れん坊,タク,まさと,しゅう,メロス,エス,ゴキジェット,クローハウザー,speedman,ゆうた,ちょいエコロ爺,もとき,しょう,れん,t,水卜,やま,たろさん,ユウ,り,よしつぐ,スザク,りょーま,タウン,わー,ひろ,ヒロト,なお,ジュン,sho,カズアキ,YOU1,りょーた,つね,たけし,りた,蒼紫,テラ,テラ,ゆーと,NoBU,RYO,ゆき,HONDA,キョウスケ,赤い彗星,hiro,ボブ,じゅんや,つばさ,はっぴー,Syo,たっくん,やっちゃん,むつ,koko,たく,match,シン,卍丸"
# えりか9/7BAN
raw ="んたすけ,兄,ファレンガー,あ,山崎,サボ,たつ,ネック,達哉,ゆう,ジョニー,まさ,フンガース,らい,さとうあまい,はる,ソラ,こ,しゅーへい,まさや,りく,すー,ささき,しょーくん,ソータ,ケイ,アガシ,やす,たあ,おーさん,隠れん坊,タク,まさと,しゅう,メロス,エス,ゴキジェット,クローハウザー,speedman,ゆうた,ちょいエコロ爺,もとき,しょう,れん,t,水卜,やま,たろさん,ユウ,り,よしつぐ,スザク,りょーま,タウン,わー,ひろ,ヒロト,なお,ジュン,sho,カズアキ,YOU1,りょーた,つね,たけし,りた,蒼紫,テラ,テラ,ゆーと,NoBU,RYO,ゆき,HONDA,キョウスケ,赤い彗星,hiro,ボブ,じゅんや,つばさ,はっぴー,Syo,たっくん,やっちゃん,むつ,koko,たく,match,シン,卍丸,かん,たすく,育也,トシ,さたけ,こうじ,はく,ぱなでん,ゆうき,たかお,ﾋｶﾙ,HS,チョコミント,ショウ,Hiro,ゆーき,はや,すーさん,らいち,Usi,モモンガ,隆,ケンタ,とー,とも,とり,こう,y-y,ケン,真昼,がみ,たくや,タマ,ここあ,ハロ,けんけん,翔"
# ハル8/29〜　いつの間にかBAN
raw = "shiba,さとし,こん,ゆうすけ,たろさん,あーきー,けん,たあ,まー,T.F,ゆう,すけ,ゆぅ,るー,つよし,あり,Gドラゴン,タク,もち,ゴキジェット,ヘンリー,まさと,speedman,のり,さかもと,matsu,ふじおか,ゴウキ,だい,あじき,やま"
# カンマで分割してリスト化
items = [s.strip() for s in raw.split(",") if s.strip()]

print(len(items))  # 要素数